content/community/game-theory.md
+++
title = "Game Theory"
author = ["Aimee Z"]
description = "Game theory, blockchain protocols, etc."
date = 2020-11-24
tags = ["blockchain", "community", "incentives", "gametheory"]
categories = ["community"]
draft = false
[menu.main]
  weight = 2010
  identifier = "game-theory"
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [Learning](#learning)

</div>
<!--endtoc-->


## Learning {#learning}

[An Axiomatic Approach to Block Rewards (Tim Roughgarden @ Stanford Blockchain Conference 2020)](https://www.youtube.com/watch?v=WyRyWQwm0x0)
> **Strategy:**
> - articulate desiderata of allocation rules
> - prove that the proportional rule the unique
    one satisfying all of them
>
> **Role models:** von Neumann-Morgenstern Utility Theory,
  Arrow/s Impossibility Theorem, the Shapley value.
>
> **Note:** impossibility/uniqueness results clarify
  the compromises required.

[An Axiomatic Approach to Block Rewards](https://arxiv.org/pdf/1909.10645.pdf)